Revit 2027 API
TemporaryViewMode Enumeration
 Enumeration to represent the various temporary view modes a view can be in.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TemporaryViewMode
Public Enumeration TemporaryViewMode
public enum class TemporaryViewMode
type TemporaryViewMode
Members
Member name | Value | Description
AcceleratedGraphicsMode | 9 |  The view is in the mode that shows Accelerated Graphics.
ExplodedView | 6 |  The view is in the mode that shows the model in exploded view and allows user changes/configurations
PreviewFamilyVisibility | 8 |  The view is in the mode that shows visibility settings applied in the environment of a family document.
RevealConstraints | 7 |  The view is in the mode that reveals constraints between elements in the model.
RevealHiddenElements | 1 |  The view is in reveal hidden elements mode
TemporaryHideIsolate | 2 |  The view is in temporary hide/isolate mode
TemporaryViewProperties | 4 |  The view is in the selected View Properties applied temporarily.
WorksharingDisplay | 3 |  The view is in one of the worksharing display modes
See Also
Reference
Autodesk.Revit.DB Namespace